rds2/app/views/notifications/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
	        <td><%= notification.text %></td>
	        <td><%= User.find(notification.user_id).name %></td>