rds2/app/views/notifications/show.html.erb

  <strong>From:</strong>
  <%= User.find(@notification.user_id).name %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1