rds2/app/controllers/notifications_controller.rb

  def index

			@notifications=  Notification.where(receiver_id: current_user.id)
---
SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`receiver_id` = 1 LIMIT 1

  def create

    @notification = Notification.new(notification_params)
		@notification.user_id = current_user.id
		@notification.type_notification = params[:notification][:type_notification]
		@notification.receiver_id= params[:notification][:receiver_id]

    respond_to do |format|
      if @notification.save
---
INSERT INTO `notifications` (`text`, `type_notification`, `user_id`, `receiver_id`, `created_at`, `updated_at`) VALUES ('QWEWRasdasdasdas', 'message', 1, 2, '2017-05-08 10:22:34', '2017-05-08 10:22:34')

  def destroy
    @notification.destroy
---
DELETE FROM `notifications` WHERE `notifications`.`id` = 1

    def set_notification
      @notification = Notification.find(params[:id])
---
SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 13 LIMIT 1