rds2/app/controllers/notifications_controller.rb

  def index
    @notifications = Notification.all
---
SELECT `notifications`.* FROM `notifications`

  def update
    respond_to do |format|
      if @notification.update(notification_params)
---
UPDATE `notifications` SET `receiver_id` = 13, `text` = 'dsfdsfsdvdfvxcvxcv', `updated_at` = '2017-05-08 10:42:19' WHERE `notifications`.`id` = 13