rds2/app/controllers/publications_controller.rb

  def index
    @publications = Publication.all
---
SELECT `publications`.* FROM `publications`

  def create

		puts
		puts
		puts
		puts
		puts
				puts params[:text]
				puts params[:date]= Time.new
				#puts params[:user_id] =current_user

		puts
		puts
		puts
		puts
		puts

    @publication = Publication.new(publication_params)

    respond_to do |format|
      if @publication.save
---
INSERT INTO `publications` (`text`, `user_id`, `created_at`, `updated_at`) VALUES ('adsdsddsdsadsa\r\ndsa\r\nsad\r\ndsa\r\ndsa\r\ndsa\r\ndsa\r\ns\r\ndsda\r\n', 1, '2017-05-03 07:34:52', '2017-05-03 07:34:52')

  def update
    respond_to do |format|
      if @publication.update(publication_params)
---
UPDATE `publications` SET `text` = 'adsdsddsdsadsa\r\ndsa\r\nsad\r\ndsa\r\ndsa\r\ndsa\r\ndsaskFJHkñhvjskjhsGDhjñkghkdsjShgdjshjkhkjsjhkdfshdjsfshjdfsjfdshkjfdsjfdjhksfdhkj\r\ns\r\ndsda\r\n', `updated_at` = '2017-05-03 07:46:05' WHERE `publications`.`id` = 1

  def destroy
    @publication.destroy
---
DELETE FROM `publications` WHERE `publications`.`id` = 2

    def set_publication
      @publication = Publication.find(params[:id])
---
SELECT  `publications`.* FROM `publications` WHERE `publications`.`id` = 2 LIMIT 1